Ракович_В_Ю_70189466/src/Documents/НазначениеЛекарств/НазначениеЛекарств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеЛекарств</name>
  <registerRecords>AccumulationRegister.ВыдачаЛекарств</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначающий</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПриема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Лекарства</name>
    <attributes>
      <name>Лекарство</name>
      <type>
        <types>CatalogRef.Лекарства</types>
      </type>
    </attributes>
    <attributes>
      <name>Дозировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПриемаНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПриемаОкончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособПриема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Ракович_В_Ю_70189466/src/AccumulationRegisters/ВыдачаЛекарств/ВыдачаЛекарств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаЛекарств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоДоз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>DocumentRef.НазначениеЛекарств</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдавший</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыдачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лекарство</name>
    <type>
      <types>CatalogRef.Лекарства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ракович_В_Ю_70189466/src/Documents/НазначениеЛекарств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Регистр накопления "ВыдачаЛекарств"
    Для Каждого СтрокаЛекарства Из Лекарства Цикл
        Движение = Движения.ВыдачаЛекарств.Добавить();
        Движение.Период = Дата;
        Движение.Студент = Студент;
        Движение.Лекарство = СтрокаЛекарства.Лекарство;
        Движение.Количество = 1;
        Движение.Назначение = Ссылка;
    КонецЦикла;
    
КонецПроцедуры
